Louwik14/Brick_ChibiOS_21.11.4/demos/STM32/RT-STM32H743ZI_REV_XY-NUCLEO144/audio/drv_audio.c
/**
 * @file drv_audio.c
 * @brief Gestion complète du pipeline audio TDM (SAI + DMA + callbacks DSP).
 */

#include "drv_audio.h"
#include "audio_codec_ada1979.h"
#include "audio_codec_pcm4104.h"
#include "mpu_config.h"
#include "chprintf.h"
#include "stm32h7xx_hal.h"
#include <string.h>

/* -------------------------------------------------------------------------- */
/* Buffers ping/pong                                                          */
/* -------------------------------------------------------------------------- */
/*
 * Placés en .ram_d2 non cacheable (voir linker/MPU) pour éliminer toute
 * incohérence D-Cache avec le DMA SAI/SPI. Le linker n'est pas modifié ici,
 * seule la documentation rappelle la contrainte de section.
 */

static volatile int32_t AUDIO_DMA_BUFFER_ATTR audio_in_buffers[2][AUDIO_FRAMES_PER_BUFFER][AUDIO_NUM_INPUT_CHANNELS];
static volatile int32_t AUDIO_DMA_BUFFER_ATTR audio_out_buffers[2][AUDIO_FRAMES_PER_BUFFER][AUDIO_NUM_OUTPUT_CHANNELS];

static volatile spilink_audio_block_t AUDIO_DMA_BUFFER_ATTR spi_in_buffers;
static volatile spilink_audio_block_t AUDIO_DMA_BUFFER_ATTR spi_out_buffers;

static volatile uint8_t audio_in_ready_index = 0xFFU;
static volatile uint8_t audio_out_ready_index = 0xFFU;

/* Synchronisation stricte RX/TX : les deux DMA doivent signaler le même demi-buffer. */
#define AUDIO_SYNC_FLAG_RX    0x01U
#define AUDIO_SYNC_FLAG_TX    0x02U
static volatile uint8_t audio_sync_mask = 0U;
static volatile uint8_t audio_sync_half = 0xFFU;

/* SPI-LINK callbacks. */
static drv_spilink_pull_cb_t spilink_pull_cb = NULL;
static drv_spilink_push_cb_t spilink_push_cb = NULL;

typedef struct {
    float gain_main;
    float gain_cue;
    bool  to_main;
    bool  to_cue;
} audio_route_t;

typedef struct {
    float            master_volume;
    audio_route_t    routes[4];
} audio_control_snapshot_t;

static struct {
    mutex_t                 lock;
    audio_control_snapshot_t state;
} audio_control;

static audio_control_snapshot_t audio_control_cached;

/* -------------------------------------------------------------------------- */
/* Synchronisation des DMA                                                    */
/* -------------------------------------------------------------------------- */

static binary_semaphore_t audio_dma_sem;

static const stm32_dma_stream_t *sai_rx_dma = NULL;
static const stm32_dma_stream_t *sai_tx_dma = NULL;
static thread_t *audio_thread = NULL;
static drv_audio_state_t audio_state = DRV_AUDIO_STOPPED;
static bool audio_initialized = false;

/* Nombre d'échantillons transférés par transaction (ping + pong). */
#define AUDIO_DMA_IN_SAMPLES   (AUDIO_FRAMES_PER_BUFFER * AUDIO_NUM_INPUT_CHANNELS * 2U)
#define AUDIO_DMA_OUT_SAMPLES  (AUDIO_FRAMES_PER_BUFFER * AUDIO_NUM_OUTPUT_CHANNELS * 2U)
#define AUDIO_INT24_MAX_F      8388607.0f
/*
 * Les tableaux [2][frames][channels] sont vus par le DMA comme un buffer
 * linéaire unique : interruption Half-Transfer => index 0 (ping),
 * interruption Transfer-Complete => index 1 (pong).
 */

/* -------------------------------------------------------------------------- */
/* Prototypes internes                                                        */
/* -------------------------------------------------------------------------- */

static void audio_hw_configure_sai(void);
static void audio_dma_start(void);
static void audio_dma_stop(void);
static void audio_routes_reset_defaults(void);
static void audio_control_init(void);
static void audio_control_get_snapshot(audio_control_snapshot_t *dst);
static float soft_clip(float x);
static void audio_dma_sync_mark(uint8_t half, uint8_t flag);

static void audio_dma_rx_cb(void *p, uint32_t flags);
static void audio_dma_tx_cb(void *p, uint32_t flags);

static THD_WORKING_AREA(audioThreadWA, AUDIO_THREAD_STACK_SIZE);
static THD_FUNCTION(audioThread, arg);

static void audio_sai_dump_regs(BaseSequentialStream *chp,
                                const char *tag,
                                const SAI_Block_TypeDef *block);
static void audio_sai_hal_debug_test(void);

/* -------------------------------------------------------------------------- */
/* API publique                                                               */
/* -------------------------------------------------------------------------- */

void drv_audio_init(void) {
    if (audio_initialized) {
        return;
    }

    if (!mpu_config_init_once()) {
        audio_state = DRV_AUDIO_FAULT;
        return;
    }

    chBSemObjectInit(&audio_dma_sem, FALSE);

    audio_control_init();

    /* Prépare le bus I2C et les codecs. */
#if AUDIO_ALLOW_NO_CODEC
    msg_t codec_status = HAL_RET_SUCCESS;
#else
    msg_t codec_status = adau1979_init();
#endif
    if (codec_status != HAL_RET_SUCCESS) {
        audio_state = DRV_AUDIO_FAULT;
        return;
    }
    audio_codec_pcm4104_init();

    audio_in_ready_index = 0xFFU;
    audio_out_ready_index = 0xFFU;
    audio_sync_mask = 0U;
    audio_sync_half = 0xFFU;

    memset((void *)audio_in_buffers, 0, sizeof(audio_in_buffers));
    memset((void *)audio_out_buffers, 0, sizeof(audio_out_buffers));
    memset((void *)spi_in_buffers, 0, sizeof(spi_in_buffers));
    memset((void *)spi_out_buffers, 0, sizeof(spi_out_buffers));
    audio_routes_reset_defaults();

    /* Les GPIO SAI sont déjà configurés via board.h. */
    audio_hw_configure_sai();

    audio_state = DRV_AUDIO_READY;
    audio_initialized = true;
}

void drv_audio_start(void) {
    if (audio_state == DRV_AUDIO_RUNNING) {
        return;
    }

    if (!audio_initialized) {
        drv_audio_init();
    }

    if (audio_state == DRV_AUDIO_FAULT) {
        audio_codec_pcm4104_set_mute(true);
        return;
    }

    audio_codec_pcm4104_set_mute(true);

#if AUDIO_ALLOW_NO_CODEC
    msg_t codec_status = HAL_RET_SUCCESS;
#else
    msg_t codec_status = adau1979_set_default_config();
#endif
    if (codec_status != HAL_RET_SUCCESS) {
        audio_state = DRV_AUDIO_FAULT;
        return;
    }

