Louwik14/Brick_ChibiOS_21.11.4/demos/STM32/RT-STM32H743ZI_REV_XY-NUCLEO144/audio/drv_audio.c
    audio_in_ready_index = 0xFFU;
    audio_out_ready_index = 0xFFU;
    audio_sync_mask = 0U;
    audio_sync_half = 0xFFU;

    audio_dma_start();
    if (audio_thread == NULL) {
        audio_thread = chThdCreateStatic(audioThreadWA,
                                         sizeof(audioThreadWA),
                                         AUDIO_THREAD_PRIORITY,
                                         audioThread,
                                         NULL);
    }
    audio_state = DRV_AUDIO_RUNNING;
    audio_codec_pcm4104_set_mute(false);
}

void drv_audio_stop(void) {
    if ((audio_state != DRV_AUDIO_RUNNING) && (audio_state != DRV_AUDIO_READY)) {
        return;
    }

    audio_codec_pcm4104_set_mute(true);
    audio_dma_stop();

    if (audio_thread != NULL) {
        chThdTerminate(audio_thread);
        chBSemSignal(&audio_dma_sem);
        chThdWait(audio_thread);
        audio_thread = NULL;
    }

    audio_state = DRV_AUDIO_STOPPED;
}

drv_audio_state_t drv_audio_get_state(void) {
    return audio_state;
}

const int32_t* drv_audio_get_input_buffer(uint8_t *index, size_t *frames) {
    chSysLock();
    uint8_t ready = audio_in_ready_index;
    audio_in_ready_index = 0xFFU;
    chSysUnlock();

    if (ready == 0xFFU) {
        return NULL;
    }
    if (index != NULL) {
        *index = ready;
    }
    if (frames != NULL) {
        *frames = AUDIO_FRAMES_PER_BUFFER;
    }
    return (const int32_t*)audio_in_buffers[ready];
}

int32_t* drv_audio_get_output_buffer(uint8_t *index, size_t *frames) {
    chSysLock();
    uint8_t ready = audio_out_ready_index;
    audio_out_ready_index = 0xFFU;
    chSysUnlock();

    if (ready == 0xFFU) {
        return NULL;
    }
    if (index != NULL) {
        *index = ready;
    }
    if (frames != NULL) {
        *frames = AUDIO_FRAMES_PER_BUFFER;
    }
    return (int32_t *)&audio_out_buffers[ready][0][0];
}

void drv_audio_release_buffers(uint8_t in_index, uint8_t out_index) {
    (void)in_index;
    (void)out_index;
    /* DMA circulaire : rien à faire, les buffers seront réécrits au prochain tour. */
}

int32_t (*drv_audio_get_spi_in_buffers(void))[AUDIO_FRAMES_PER_BUFFER][4] {
    return (int32_t (*)[AUDIO_FRAMES_PER_BUFFER][4])spi_in_buffers;
}

int32_t (*drv_audio_get_spi_out_buffers(void))[AUDIO_FRAMES_PER_BUFFER][4] {
    return (int32_t (*)[AUDIO_FRAMES_PER_BUFFER][4])spi_out_buffers;
}

size_t drv_audio_get_spi_frames(void) {
    return AUDIO_FRAMES_PER_BUFFER;
}

void drv_audio_register_spilink_pull(drv_spilink_pull_cb_t cb) {
    spilink_pull_cb = cb;
}

void drv_audio_register_spilink_push(drv_spilink_push_cb_t cb) {
    spilink_push_cb = cb;
}

void drv_audio_set_master_volume(float vol) {
    if (vol < 0.0f) {
        vol = 0.0f;
    }
    chMtxLock(&audio_control.lock);
    audio_control.state.master_volume = vol;
    chMtxUnlock(&audio_control.lock);
}

void drv_audio_set_route(uint8_t track, bool to_main, bool to_cue) {
    if (track >= 4U) {
        return;
    }

    chMtxLock(&audio_control.lock);
    audio_control.state.routes[track].to_main = to_main;
    audio_control.state.routes[track].to_cue = to_cue;
    chMtxUnlock(&audio_control.lock);
}

static float clamp_0_1(float v) {
    if (v < 0.0f) {
        return 0.0f;
    }
    if (v > 1.0f) {
        return 1.0f;
    }
    return v;
}

static void audio_control_init(void) {
    chMtxObjectInit(&audio_control.lock);
    audio_routes_reset_defaults();
}

static void audio_control_get_snapshot(audio_control_snapshot_t *dst) {
    if (dst == NULL) {
        return;
    }
    chMtxLock(&audio_control.lock);
    *dst = audio_control.state;
    chMtxUnlock(&audio_control.lock);
}

void drv_audio_set_route_gain(uint8_t track, float gain_main, float gain_cue) {
    if (track >= 4U) {
        return;
    }

    chMtxLock(&audio_control.lock);
    audio_control.state.routes[track].gain_main = clamp_0_1(gain_main);
    audio_control.state.routes[track].gain_cue = clamp_0_1(gain_cue);
    chMtxUnlock(&audio_control.lock);
}

static void audio_routes_reset_defaults(void) {
    chMtxLock(&audio_control.lock);
    audio_control.state.master_volume = 1.0f;
    for (uint8_t t = 0U; t < 4U; ++t) {
        audio_control.state.routes[t].gain_main = 1.0f;
        audio_control.state.routes[t].gain_cue = 1.0f;
        audio_control.state.routes[t].to_main = true;
        audio_control.state.routes[t].to_cue = false;
    }
    audio_control_cached = audio_control.state;
    chMtxUnlock(&audio_control.lock);
}

static float soft_clip(float x) {
    const float threshold = 0.95f;
    if (x > threshold) {
        const float excess = x - threshold;
        return threshold + (excess / (1.0f + (excess * excess)));
    }
    if (x < -threshold) {
        const float excess = x + threshold;
        return -threshold + (excess / (1.0f + (excess * excess)));
    }
    return x;
}

static void audio_dma_sync_mark(uint8_t half, uint8_t flag) {
    chSysLockFromISR();

    if (audio_sync_half != half) {
        audio_sync_half = half;
        audio_sync_mask = 0U;
    }

    audio_sync_mask |= flag;

    if ((audio_sync_mask & (AUDIO_SYNC_FLAG_RX | AUDIO_SYNC_FLAG_TX)) ==
        (AUDIO_SYNC_FLAG_RX | AUDIO_SYNC_FLAG_TX)) {
        audio_in_ready_index = half;
        audio_out_ready_index = half;
        audio_sync_mask = 0U;
        audio_sync_half = 0xFFU;
        chBSemSignalI(&audio_dma_sem);
    }

    chSysUnlockFromISR();
}

/* -------------------------------------------------------------------------- */
/* Hook DSP faible                                                            */
/* -------------------------------------------------------------------------- */

void __attribute__((weak)) drv_audio_process_block(const int32_t              *adc_in,
                                                   const spilink_audio_block_t spi_in,
                                                   int32_t                    *dac_out,
                                                   spilink_audio_block_t       spi_out,
                                                   size_t                      frames) {
    (void)spi_in;

