Louwik14/Brick_ChibiOS_21.11.4/demos/STM32/RT-STM32H743ZI_REV_XY-NUCLEO144/audio/drv_audio.c
    const float inv_scale = 1.0f / AUDIO_INT24_MAX_F;
    const audio_control_snapshot_t *ctrl = &audio_control_cached;
    float master = ctrl->master_volume;
    if (master < 0.0f) {
        master = 0.0f;
    }

    const int32_t *adc_ptr = adc_in;
    int32_t *dac_ptr = dac_out;

    for (size_t n = 0; n < frames; ++n) {
        float main_l = 0.0f;
        float main_r = 0.0f;
        float cue_l  = 0.0f;
        float cue_r  = 0.0f;

        for (uint8_t track = 0U; track < 4U; ++track) {
            const audio_route_t *route = &ctrl->routes[track];
            size_t base = (size_t)track * 2U;
            float in_l = (float)adc_ptr[base] * inv_scale;
            float in_r = (float)adc_ptr[base + 1U] * inv_scale;

            if (route->to_main) {
                main_l += in_l * route->gain_main;
                main_r += in_r * route->gain_main;
            }
            if (route->to_cue) {
                cue_l += in_l * route->gain_cue;
                cue_r += in_r * route->gain_cue;
            }
        }

        main_l = soft_clip(main_l);
        main_r = soft_clip(main_r);
        cue_l = soft_clip(cue_l);
        cue_r = soft_clip(cue_r);

        main_l = soft_clip(main_l * master);
        main_r = soft_clip(main_r * master);
        cue_l = soft_clip(cue_l * master);
        cue_r = soft_clip(cue_r * master);

        dac_ptr[0] = (int32_t)(main_l * AUDIO_INT24_MAX_F);
        dac_ptr[1] = (int32_t)(main_r * AUDIO_INT24_MAX_F);
        dac_ptr[2] = (int32_t)(cue_l * AUDIO_INT24_MAX_F);
        dac_ptr[3] = (int32_t)(cue_r * AUDIO_INT24_MAX_F);

        adc_ptr += AUDIO_NUM_INPUT_CHANNELS;
        dac_ptr += AUDIO_NUM_OUTPUT_CHANNELS;
    }

    if (spi_out != NULL) {
        memset(spi_out, 0, sizeof(spi_out_buffers));
    }
}

void __attribute__((weak)) drv_audio_dma_half_cb(uint8_t half) {
    (void)half;
}

void __attribute__((weak)) drv_audio_dma_full_cb(uint8_t half) {
    (void)half;
}

/* -------------------------------------------------------------------------- */
/* Thread audio : déclenché par les callbacks DMA                             */
/* -------------------------------------------------------------------------- */

static THD_FUNCTION(audioThread, arg) {
    (void)arg;
    chRegSetThreadName("audioProcess");

    while (!chThdShouldTerminateX()) {
        chBSemWait(&audio_dma_sem);

        uint8_t in_idx, out_idx;
        size_t frames = AUDIO_FRAMES_PER_BUFFER;

        chSysLock();
        if (audio_in_ready_index == 0xFFU || audio_out_ready_index == 0xFFU) {
            chSysUnlock();
            continue;
        }
        in_idx = audio_in_ready_index;
        out_idx = audio_out_ready_index;
        audio_in_ready_index = 0xFFU;
        audio_out_ready_index = 0xFFU;
        chSysUnlock();

        const int32_t *in_buf = (const int32_t *)audio_in_buffers[in_idx];
        int32_t *out_buf = (int32_t *)audio_out_buffers[out_idx];

        /* Récupère l'audio des cartouches si disponible. */
        if (spilink_pull_cb != NULL) {
            spilink_pull_cb((int32_t (*)[AUDIO_FRAMES_PER_BUFFER][4])spi_in_buffers, frames);
        } else {
            memset((void *)spi_in_buffers, 0, sizeof(spi_in_buffers));
        }

        audio_control_snapshot_t ctrl_snapshot;
        audio_control_get_snapshot(&ctrl_snapshot);
        audio_control_cached = ctrl_snapshot;

        drv_audio_process_block(in_buf,
                                 (int32_t (*)[AUDIO_FRAMES_PER_BUFFER][4])spi_in_buffers,
                                 out_buf,
                                 (int32_t (*)[AUDIO_FRAMES_PER_BUFFER][4])spi_out_buffers,
                                 frames);

        /* Exporte le flux vers les cartouches si besoin. */
        if (spilink_push_cb != NULL) {
            spilink_push_cb((int32_t (*)[AUDIO_FRAMES_PER_BUFFER][4])spi_out_buffers, frames);
        }
    }
}

/* -------------------------------------------------------------------------- */
/* Configuration SAI + DMA                                                    */
/* -------------------------------------------------------------------------- */

static void audio_hw_configure_sai(void) {
#if defined(STM32H7xx) && defined(SAI_xCR1_MODE_0)
    audio_sai_hal_debug_test();

    /* Active les horloges SAI et force la réinitialisation. */
    rccEnableSAI2(true);
    rccResetSAI2();

    /*
     * Horloges audio : PLL3_P = 49.152 MHz (mcuconf.h) -> MCLK = PLL3_P / 4 = 12.288 MHz.
     * BCLK = MCLK (TDM 256 bits) et FS = BCLK / (32 * 8) = 48 kHz.
     */

    /* Bloc B = maître RX TDM 8x32 bits, données valides sur 24 bits MSB. */
    AUDIO_SAI_RX_BLOCK->CR1 = SAI_xCR1_MODE_0 |           /* Master Receiver (génère BCLK/FS). */
                              SAI_xCR1_PRTCFG_0 |        /* Free protocol. */
                              SAI_xCR1_DS_4 | SAI_xCR1_DS_2 | /* 24 bits data size (slot 32 bits). */
                              ((3U << 20U)) |             /* MCKDIV = 3 -> PLL3_P/4 = 12.288 MHz. */
                              SAI_xCR1_CKSTR;             /* Données échantillonnées sur front montant. */
    AUDIO_SAI_RX_BLOCK->CR2 = SAI_xCR2_FTH_0;             /* Threshold half FIFO. */
    /* Frame 8 slots de 32 bits => 256 bits. FSALL = 128-1 (FS = 50% duty), FRL = 256-1. */
    AUDIO_SAI_RX_BLOCK->FRCR = ((256U - 1U) << SAI_xFRCR_FRL_Pos) |
                               ((128U - 1U) << SAI_xFRCR_FSALL_Pos) |
                               SAI_xFRCR_FSDEF | SAI_xFRCR_FSOFF;
    /* Slot: 8 slots, 32 bits (SLOTSZ_1). FBOFF=0 => premier bit juste après FS. */
    AUDIO_SAI_RX_BLOCK->SLOTR = (0U << SAI_xSLOTR_FBOFF_Pos) |
                                (SAI_xSLOTR_SLOTSZ_1) |
                                ((AUDIO_NUM_INPUT_CHANNELS - 1U) << SAI_xSLOTR_NBSLOT_Pos) |
                                0x00FFU; /* Slots 0..7 actifs */

    /* Bloc A = esclave TX TDM 4x32 bits, synchronisé sur bloc B. */
    AUDIO_SAI_TX_BLOCK->CR1 = SAI_xCR1_MODE_1 |           /* Slave Transmitter. */
                              SAI_xCR1_PRTCFG_0 |
                              SAI_xCR1_DS_4 | SAI_xCR1_DS_2 |
                              SAI_xCR1_SYNCEN_0;          /* Synchro interne sur bloc B. */
    AUDIO_SAI_TX_BLOCK->CR2 = SAI_xCR2_FTH_0;
    /* Frame 4 slots de 32 bits => 128 bits. FSALL = 64-1, FRL = 128-1. */
    AUDIO_SAI_TX_BLOCK->FRCR = ((128U - 1U) << SAI_xFRCR_FRL_Pos) |
                               ((64U - 1U) << SAI_xFRCR_FSALL_Pos) |
                               SAI_xFRCR_FSDEF | SAI_xFRCR_FSOFF;
    AUDIO_SAI_TX_BLOCK->SLOTR = (0U << SAI_xSLOTR_FBOFF_Pos) |
                                (SAI_xSLOTR_SLOTSZ_1) |
                                ((AUDIO_NUM_OUTPUT_CHANNELS - 1U) << SAI_xSLOTR_NBSLOT_Pos) |
                                0x000FU; /* Slots 0..3 actifs */

    /* Seul le bloc B (maître RX) génère les horloges MCLK/BCLK/FS pour éviter tout double pilotage. */
    AUDIO_SAI_RX_BLOCK->CR1 |= SAI_xCR1_OUTDRIV;
    /* Bloc A TX reste un esclave synchronisé : ne pas activer OUTDRIV/NODIV côté TX. */
#endif
}

