Louwik14/Brick_ChibiOS_21.11.4/demos/STM32/RT-STM32H743ZI_REV_XY-NUCLEO144/audio/drv_audio.c
static void audio_dma_start(void) {
#if STM32_DMA_SUPPORTS_DMAMUX == TRUE
    sai_rx_dma = dmaStreamAlloc(AUDIO_SAI_RX_DMA_STREAM,
                                AUDIO_SAI_RX_DMA_PRIORITY,
                                audio_dma_rx_cb,
                                NULL);
    sai_tx_dma = dmaStreamAlloc(AUDIO_SAI_TX_DMA_STREAM,
                                AUDIO_SAI_TX_DMA_PRIORITY,
                                audio_dma_tx_cb,
                                NULL);

    dmaSetRequestSource(sai_rx_dma, AUDIO_SAI_RX_DMA_REQUEST);
    dmaSetRequestSource(sai_tx_dma, AUDIO_SAI_TX_DMA_REQUEST);

    /* RX : P2M, 32 bits, circulaire, half/full interrupt. */
    uint32_t rx_mode = STM32_DMA_CR_PL(AUDIO_SAI_RX_DMA_PRIORITY) |
                       STM32_DMA_CR_DIR_P2M |
                       STM32_DMA_CR_PSIZE_WORD |
                       STM32_DMA_CR_MSIZE_WORD |
                       STM32_DMA_CR_MINC |
                       STM32_DMA_CR_CIRC |
                       STM32_DMA_CR_HTIE |
                       STM32_DMA_CR_TCIE;

    dmaStreamSetPeripheral(sai_rx_dma, &AUDIO_SAI_RX_BLOCK->DR);
    dmaStreamSetMemory0(sai_rx_dma, (void *)audio_in_buffers);
    dmaStreamSetTransactionSize(sai_rx_dma, AUDIO_DMA_IN_SAMPLES);
    dmaStreamSetMode(sai_rx_dma, rx_mode);

    /* TX : M2P, 32 bits, circulaire, half/full interrupt. */
    uint32_t tx_mode = STM32_DMA_CR_PL(AUDIO_SAI_TX_DMA_PRIORITY) |
                       STM32_DMA_CR_DIR_M2P |
                       STM32_DMA_CR_PSIZE_WORD |
                       STM32_DMA_CR_MSIZE_WORD |
                       STM32_DMA_CR_MINC |
                       STM32_DMA_CR_CIRC |
                       STM32_DMA_CR_HTIE |
                       STM32_DMA_CR_TCIE;

    dmaStreamSetPeripheral(sai_tx_dma, &AUDIO_SAI_TX_BLOCK->DR);
    dmaStreamSetMemory0(sai_tx_dma, (void *)audio_out_buffers);
    dmaStreamSetTransactionSize(sai_tx_dma, AUDIO_DMA_OUT_SAMPLES);
    dmaStreamSetMode(sai_tx_dma, tx_mode);

    dmaStreamEnable(sai_rx_dma);
    dmaStreamEnable(sai_tx_dma);

    /* Active DMA puis SAI. */
    AUDIO_SAI_RX_BLOCK->CR1 |= SAI_xCR1_DMAEN;
    AUDIO_SAI_TX_BLOCK->CR1 |= SAI_xCR1_DMAEN;
    AUDIO_SAI_TX_BLOCK->CR1 |= SAI_xCR1_SAIEN;
    AUDIO_SAI_RX_BLOCK->CR1 |= SAI_xCR1_MCKEN;
    AUDIO_SAI_RX_BLOCK->CR1 |= SAI_xCR1_SAIEN;
#else
    (void)audio_dma_rx_cb;
    (void)audio_dma_tx_cb;
#endif
}

static void audio_dma_stop(void) {
    if (sai_rx_dma != NULL) {
        dmaStreamDisable(sai_rx_dma);
        dmaStreamFree(sai_rx_dma);
        sai_rx_dma = NULL;
    }
    if (sai_tx_dma != NULL) {
        dmaStreamDisable(sai_tx_dma);
        dmaStreamFree(sai_tx_dma);
        sai_tx_dma = NULL;
    }

    AUDIO_SAI_RX_BLOCK->CR1 &= ~(SAI_xCR1_SAIEN | SAI_xCR1_DMAEN);
    AUDIO_SAI_TX_BLOCK->CR1 &= ~(SAI_xCR1_SAIEN | SAI_xCR1_DMAEN);
}

/* Callbacks DMA : half/full -> signale le thread. */
static void audio_dma_rx_cb(void *p, uint32_t flags) {
    (void)p;
    if ((flags & (STM32_DMA_ISR_TEIF | STM32_DMA_ISR_DMEIF | STM32_DMA_ISR_FEIF)) != 0U) {
        chSysHalt("AUDIO DMA ERROR");
    }
    if ((flags & (STM32_DMA_ISR_HTIF | STM32_DMA_ISR_TCIF)) != 0U) {
        bool is_half = ((flags & STM32_DMA_ISR_HTIF) != 0U);
        uint8_t half = is_half ? 0U : 1U;
        if (is_half) {
            drv_audio_dma_half_cb(half);
        } else {
            drv_audio_dma_full_cb(half);
        }
        audio_dma_sync_mark(half, AUDIO_SYNC_FLAG_RX);
    }
}

static void audio_dma_tx_cb(void *p, uint32_t flags) {
    (void)p;
    if ((flags & (STM32_DMA_ISR_TEIF | STM32_DMA_ISR_DMEIF | STM32_DMA_ISR_FEIF)) != 0U) {
        chSysHalt("AUDIO DMA ERROR");
    }
    if ((flags & (STM32_DMA_ISR_HTIF | STM32_DMA_ISR_TCIF)) != 0U) {
        uint8_t half = ((flags & STM32_DMA_ISR_HTIF) != 0U) ? 0U : 1U;
        audio_dma_sync_mark(half, AUDIO_SYNC_FLAG_TX);
    }
}

static void audio_sai_dump_regs(BaseSequentialStream *chp,
                                const char *tag,
                                const SAI_Block_TypeDef *block) {
    chprintf(chp,
             "[SAI %s] CR1=0x%08lx CR2=0x%08lx FRCR=0x%08lx SLOTR=0x%08lx IMR=0x%08lx SR=0x%08lx\r\n",
             tag,
             (unsigned long)block->CR1,
             (unsigned long)block->CR2,
             (unsigned long)block->FRCR,
             (unsigned long)block->SLOTR,
             (unsigned long)block->IMR,
             (unsigned long)block->SR);
}

static void audio_sai_hal_debug_test(void) {
#if defined(STM32H7xx) && defined(SAI_xCR1_MODE_0)
    static bool ran = false;
    if (ran) {
        return;
    }
    ran = true;

    BaseSequentialStream *chp = (BaseSequentialStream *)&SD1;
    SAI_HandleTypeDef hsai;
    memset(&hsai, 0, sizeof(hsai));

    hsai.Instance = AUDIO_SAI_RX_BLOCK;
    hsai.Init.AudioMode = SAI_MODEMASTER_RX;
    hsai.Init.Synchro = SAI_ASYNCHRONOUS;
    hsai.Init.OutputDrive = SAI_OUTPUTDRIVE_ENABLE;
    hsai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLE;
    hsai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_HF;
    hsai.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_48K;
    hsai.Init.Mckdiv = 0U;
    hsai.Init.MckOverSampling = SAI_MCK_OVERSAMPLING_DISABLE;
    hsai.Init.MonoStereoMode = SAI_STEREOMODE;
    hsai.Init.CompandingMode = SAI_NOCOMPANDING;
    hsai.Init.TriState = SAI_OUTPUT_NOTRELEASED;
    hsai.Init.Protocol = SAI_FREE_PROTOCOL;
    hsai.Init.DataSize = SAI_DATASIZE_24;
    hsai.Init.FirstBit = SAI_FIRSTBIT_MSB;
    hsai.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;

    hsai.FrameInit.FrameLength = 256U;
    hsai.FrameInit.ActiveFrameLength = 128U;
    hsai.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai.FrameInit.FSPolarity = SAI_FS_ACTIVE_HIGH;
    hsai.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

    hsai.SlotInit.FirstBitOffset = 0U;
    hsai.SlotInit.SlotSize = SAI_SLOTSIZE_32B;
    hsai.SlotInit.SlotNumber = AUDIO_NUM_INPUT_CHANNELS;
    hsai.SlotInit.SlotActive = 0x00FFU;

    HAL_StatusTypeDef status = HAL_SAI_Init(&hsai);
    chprintf(chp, "[SAI HAL] HAL_SAI_Init=%lu\r\n", (unsigned long)status);
    audio_sai_dump_regs(chp, "post_init", AUDIO_SAI_RX_BLOCK);

    AUDIO_SAI_RX_BLOCK->CR1 |= SAI_xCR1_SAIEN;
    chThdSleepMilliseconds(1000);
    chprintf(chp, "[SAI HAL] SR after SAIEN=0x%08lx\r\n",
             (unsigned long)AUDIO_SAI_RX_BLOCK->SR);

    AUDIO_SAI_RX_BLOCK->CR1 &= ~SAI_xCR1_SAIEN;
#endif
}
